In [1]:
# Import Dependencies
from bs4 import BeautifulSoup
from pprint import pprint
from splinter import Browser
from webdriver_manager.firefox import GeckoDriverManager

import pandas as pd
import numpy as np

In [2]:
# Initialize the Firefox browser with webdriver_manager
browser = Browser('firefox', executable_path=GeckoDriverManager().install())

In [3]:
#######################################
# Season Set 1
#######################################

seasons = [1, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]
urls = []
for season in seasons:
    url = f'https://en.wikipedia.org/wiki/The_Bachelor_(American_season_{season})'
    urls.append(url)

season_set_1 = pd.DataFrame()

for url, season in zip(urls, seasons):
    browser.visit(url)
    tables = pd.read_html(browser.html)
    df = tables[1]
    df['season'] = season
    season_set_1 = pd.concat([season_set_1, df], axis=0)

season_set_1.head()

,Name,Age,Hometown,Job,Eliminated,season,Occupation,Outcome,Place,Ref
0,Amanda Marsh,23.0,"Chanute, Kansas",Event Planner,Winner,1,NaN,NaN,NaN,NaN
1,Trista Rehn,29.0,"St. Louis, Missouri",Miami Heat Dancer,Runner-up,1,NaN,NaN,NaN,NaN
2,Shannon Oliver,24.0,"Dallas, Texas",Financial Management Consultant,Week 5,1,NaN,NaN,NaN,NaN
3,Kimberly Karels,24.0,"Tempe, Arizona",Nanny,Week 4,1,NaN,NaN,NaN,NaN
4,Cathy Grimes,22.0,"Terre Haute, Indiana",Graduate Student,Week 3,1,NaN,NaN,NaN,NaN

In [4]:
#######################################
# Season Set 2
#######################################

seasons = [2, 5]
urls = []
for season in seasons:
    url = f'https://en.wikipedia.org/wiki/The_Bachelor_(American_season_{season})'
    urls.append(url)

season_set_2 = pd.DataFrame()

for url, season in zip(urls, seasons):
    browser.visit(url)
    tables = pd.read_html(browser.html)
    df = tables[2]
    df['season'] = season
    season_set_2 = pd.concat([season_set_2, df], axis=0)

season_set_2.head()

,Name,Age,Hometown,Job,Eliminated,season,Occupation,Outcome
0,Helene Eksterowicz,27,"Gloucester, New Jersey",School Psychologist,Winner,2,NaN,NaN
1,Brooke Smith,22,"Albertville, Alabama",College Student,Runner-up,2,NaN,NaN
2,Gwen Gioia,31,"Philadelphia, Pennsylvania",Executive Recruiter,Week 6,2,NaN,NaN
3,Angela Vaught,27,"Kansas City, Missouri",Registered Nurse,Week 5,2,NaN,NaN
4,Hayley Crittenden,28,"Lake Oswego, Oregon",Retail Manager,Week 4,2,NaN,NaN

In [5]:
#######################################
# Season Set 3 (hold outs 23)
#######################################

seasons = [20, 21, 22, 24, 25, 26, 27]
urls = []
for season in seasons:
    url = f'https://en.wikipedia.org/wiki/The_Bachelor_(American_season_{season})'
    urls.append(url)

season_set_3 = pd.DataFrame()

for url, season in zip(urls, seasons):
    browser.visit(url)
    tables = pd.read_html(browser.html)
    df = tables[1]
    df['season'] = season
    season_set_3 = pd.concat([season_set_3, df], axis=0)

season_set_3.head()

,Name,Age,Hometown,Occupation,Outcome,Place,Ref,season,Arrived
0,Lauren Bushnell[9],25,"West Linn, Oregon",Flight Attendant,Winner,1,[10],20,NaN
1,"Joelle ""JoJo"" Fletcher[6][11]",24,"Dallas, Texas",Real Estate Developer,Runner-up,2,[10],20,NaN
2,Caila Quinn[12],24,"Hudson, Ohio",Software Sales Representative,Week 9,3,[13],20,NaN
3,Amanda Stanton[11][14],25,"Laguna Beach, California",Esthetician,Week 8,4,[15],20,NaN
4,Becca Tilley[16],26,"Shreveport, Louisiana",Chiropractic Assistant,Week 7,5,[17],20,NaN

In [6]:
#######################################
# Season 19 and 23 (errored out on script)
#######################################

season_19 = pd.read_csv('resources/season_19.csv')
season_23 = pd.read_csv('resources/season_23.csv')
season_set_4 =pd.concat([season_19, season_23], axis=0)

season_set_4.head()

,Name,season,Age,Hometown,Occupation,Outcome,Place,Ref
0,Whitney Bischoff[7][8],19,29,"Louisville, Kentucky",Fertility Nurse,Winner,1,[9]
1,Trina Scherenberg[14][29],19,33,"Algonquin, Illinois",Special Education Teacher,Week 3,16–18,[27]
2,Tracy Darakis[28],19,29,"Wellington, Florida",Fourth Grade Teacher,Week 3,16–18,[27]
3,Tara Eddings[7][34],19,26,"Fort Lauderdale, Florida",Sport Fishing Enthusiast,Week 2,19–23,[30]
4,Tandra Steiner[7],19,30,"Sandy, Utah",Executive Assistant,Week 2,19–23,[30]

In [7]:
#######################################
# Season 28 Contestant Data
#######################################

url = f'https://en.wikipedia.org/wiki/The_Bachelor_(American_season_28)'
browser.visit(url)
tables = pd.read_html(browser.html)
contestants_df = tables[1]

contestants_df.head()

,Name,Age,Hometown,Occupation,Outcome,Place,Ref
0,Allison Hollinger[a][11],26,"Dover, Delaware",NaN,Participating,Participating,NaN
1,Autumn Waggoner[12],26,"De Soto, Missouri",NaN,Participating,Participating,NaN
2,Chandler Dewgard[12],24,"Brooklyn, New York",NaN,Participating,Participating,NaN
3,Chrissa Perez[13],26,"Abbotsford, British Columbia",NaN,Participating,Participating,NaN
4,Daisy Kent[14],25,"Becker, Minnesota",NaN,Participating,Participating,NaN

In [10]:
##################################
# Export Center
##################################

historical_data = pd.concat([season_set_1, season_set_2, season_set_3, season_set_4], axis=0)
historical_data.to_csv('resources/historical_data.csv')
contestants_df.to_csv('resources/contestants.csv')

In [11]:
# Stop or close the browser
browser.quit()